Tekla.Structures.ModelInternal.SpiralNode
The SpiralNode class represents a spiral surface node in geometry tree.

Tekla.Structures.ModelInternal.SpiralNode.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.Double,System.Double,System.Double)
Initializes a new instance of the SpiralNode class.
startPoint: The starting point of the spiral.
rotationAxisBasePoint: The first definition point of the spiral rotation axis.
rotationAxisUpPoint: The second definition point of the spiral rotation axis.
totalRise: Difference in rotation axis direction between the start and end point of the spiral.
rotationAngle: Rotation angle of the spiral, in degrees.
twistAngleStart: Twist angle angle at the spiral start, in degrees.
twistAngleEnd: Twist angle at the spiral end, in degrees.

Tekla.Structures.ModelInternal.SpiralNode.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,System.Double,System.Double,System.Double,System.Double)
Initializes a new instance of the SpiralNode class.
rotationAxisPoint: A point on the spiral rotation axis.
startPoint: The starting point of the spiral.
rotationAxis: The rotation axis of the spiral.
totalRise: Difference in rotationAxis direction between the start and end point of the spiral.
rotationAngle: Rotation angle of the spiral, in degrees.
twistAngleStart: Twist angle angle at the spiral start, in degrees.
twistAngleEnd: Twist angle at the spiral end, in degrees.

Tekla.Structures.ModelInternal.SpiralNode.IsAutomatic
Gets a value indicating whether this geometry node was automatically generated (returns false if it was originally a user-defined part)

Tekla.Structures.ModelInternal.SpiralNode.CenterPoint
Gets the center point of the spiral geometry node.

Tekla.Structures.ModelInternal.SpiralNode.StartPoint
Gets the starting point of the spiral geometry node.

Tekla.Structures.ModelInternal.SpiralNode.RotationAxisBasePoint
Gets the first user-defined point on the rotation axis of the spiral geometry node.

Tekla.Structures.ModelInternal.SpiralNode.RotationAxisUpPoint
Gets the second user-defined point on the rotation axis of the spiral geometry node.

Tekla.Structures.ModelInternal.SpiralNode.RotationAxis
Gets the rotation axis direction of the spiral geometry node.

Tekla.Structures.ModelInternal.SpiralNode.Radius
Gets the radius of the spiral geometry node.

Tekla.Structures.ModelInternal.SpiralNode.TotalRise
Gets the difference between the spiral start and end points in the rotation axis direction.

Tekla.Structures.ModelInternal.SpiralNode.RotationAngle
Gets the cumulative rotation angle of the spiral node, in degrees.

Tekla.Structures.ModelInternal.SpiralNode.TwistAngleStart
Gets the twist angle at the helix start, in degrees.

Tekla.Structures.ModelInternal.SpiralNode.TwistAngleEnd
Gets the twist angle at the helix end, in degrees.

Tekla.Structures.ModelInternal.SpiralNode.AcceptVisitor(Tekla.Structures.Model.IGeometryNodeVisitor)
Entry method for the visitor pattern.
visitor:

Tekla.Structures.ModelInternal.SpiralNode.Clone
Creates a new object that is a copy of the current instance.
Returns: A new object that is a copy of the current instance.